Вот README.md для проекта с реализацией алгоритма Форда-Фалкерсона.

---

# Задача построения максимального потока в сети. Алгоритм Форда-Фалкерсона

Этот проект реализует алгоритм Форда-Фалкерсона для вычисления максимального потока в сети. Реализация предоставлена как на Python (`ford_fulkerson.py`), так и на C++ (`ford_fulkerson.cpp`). Модуль тестирования также доступен для обеих версий.

---

## Структура проекта

```
Общая папка/
├── ford_fulkerson.py         # Реализация алгоритма на Python
├── test_ford_fulkerson.py    # Тестирование Python-версии
├── ford_fulkerson.cpp        # Реализация алгоритма на C++
├── test_ford_fulkerson.cpp   # Тестирование C++-версии
├── input.txt                 # Пример входных данных (опционально)
├── README.md                 # Описание проекта
```

---

## Используемые файлы

### 1. `ford_fulkerson.py` (Python)

Файл содержит реализацию алгоритма Форда-Фалкерсона для построения максимального потока.

#### Основные функции:
- **`add_edge(u, v, capacity)`**  
  Добавляет ребро с пропускной способностью в граф.
- **`bfs(source, sink, parent)`**  
  Выполняет поиск пути увеличения потока с использованием BFS.
- **`max_flow(source, sink)`**  
  Вычисляет максимальный поток от истока \( source \) до стока \( sink \).

#### Пример использования:
```python
from ford_fulkerson import FordFulkerson

ff = FordFulkerson(6)
edges = [
    (0, 1, 16),
    (0, 2, 13),
    (1, 2, 10),
    (1, 3, 12),
    (2, 4, 14),
    (3, 5, 20),
    (4, 5, 4)
]
for u, v, capacity in edges:
    ff.add_edge(u, v, capacity)

print("Максимальный поток:", ff.max_flow(0, 5))  # Вывод: Максимальный поток: 23
```

---

### 2. `test_ford_fulkerson.py` (Python)

Модуль тестирования для Python-реализации. Использует `unittest`.

#### Как запустить:
```bash
python test_ford_fulkerson.py
```

#### Пример вывода:
```plaintext
...
----------------------------------------------------------------------
Ran 3 tests in 0.001s

OK
```

---

### 3. `ford_fulkerson.cpp` (C++)

Оптимизированная реализация алгоритма на C++. Использует матрицу пропускных способностей и BFS для поиска путей увеличения потока.

#### Основные функции:
- **`add_edge(u, v, capacity)`**  
  Добавляет ребро с пропускной способностью.
- **`bfs(source, sink, parent)`**  
  Выполняет поиск пути увеличения потока.
- **`max_flow(source, sink)`**  
  Возвращает максимальный поток от истока \( source \) до стока \( sink \).

#### Пример входных данных (`input.txt`):
```plaintext
6 10
0 1 16
0 2 13
1 2 10
1 3 12
2 1 4
2 4 14
3 2 9
3 5 20
4 3 7
4 5 4
0 5
```

#### Компиляция и запуск:
```bash
g++ ford_fulkerson.cpp -o ford_fulkerson
./ford_fulkerson < input.txt
```

#### Пример вывода:
```plaintext
Максимальный поток: 23
```

---

### 4. `test_ford_fulkerson.cpp` (C++)

Модуль тестирования для C++-реализации. Использует `assert` для проверки корректности.

#### Компиляция и запуск тестов:
```bash
g++ -DTESTING test_ford_fulkerson.cpp -o test_ford_fulkerson
./test_ford_fulkerson
```

#### Пример вывода:
```plaintext
Test case 1 passed!
Test case 2 passed!
Test case 3 passed!
All test cases passed!
```

---

## Пример работы

### Входные данные:
```plaintext
6 10
0 1 16
0 2 13
1 2 10
1 3 12
2 1 4
2 4 14
3 2 9
3 5 20
4 3 7
4 5 4
0 5
```

### Вывод Python-версии:
```plaintext
Максимальный поток: 23
```

### Вывод C++-версии:
```plaintext
Максимальный поток: 23
```

---

## Зависимости

### Для Python
- Python 3.9 или выше.
- Модуль `unittest` (входит в стандартную библиотеку Python).

### Для C++
- Компилятор, поддерживающий стандарт C++17 или выше (например, GCC, Clang, MSVC).

---

## Преимущества реализации

### Python
- Удобство разработки и тестирования.
- Легкость в понимании и адаптации.

### C++
- Высокая производительность для больших графов.
- Возможность обработки графов с десятками тысяч вершин и рёбер.

---

## Примечания

- Для больших графов рекомендуется использовать версию на C++ из-за её скорости и эффективности.
- Убедитесь, что входные данные находятся в UTF-8 и правильно отформатированы.

---

Если у вас есть дополнительные вопросы или пожелания, дайте знать! 😊